// Задача 00
Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int res = number * number;
Console.WriteLine($"Квадрат числа {number} равен {res}");

